<?php

$str = "Я люблю море. Я лечу на море. Я умею плавать в море. Какое чистое море! Хочу на море. Завтра поедем на море.";

// Вырезаем из строки знаки препинания
$str_cut = str_replace(['.','!',','],'',$str);

// Преобразуем строку в массив
$arr = explode(' ', $str_cut);

// Подсчитываем повторяющиеся колличество значений массива
$arr_count = array_count_values($arr);

// Если слово повторяется более 1 раза, то берем это слово, переворачиваем его и заменяем
// в исходной строке, с выводом на экран.
// Получилось 3 предложения, т.к. каждый раз берется исходная строка. Как сохранить прогресс
// в одной переменной, к сожалению, не понял.
foreach ($arr_count as $key => $value) {

    if ($value > 1) {
        $invert = strrev($key);
        $str_modified = str_replace($key, $invert, $str);
        echo $str_modified . "\n";
    }
}
